#### PromptText Property

---

|  |
| --- |
| TextBox Class   See Also |

The prompt text for the text box.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string PromptText { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PromptText As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ PromptText { 	String^ get (); 	void set (String^ value); } ``` |

# Remarks

Prompt text is displayed when the text box is empty and does not have keyboard focus. This text is displayed in italics. The default value is    a null reference (  Nothing  in Visual Basic)  .

# See Also

TextBox Class

Autodesk.Revit.UI Namespace